
#Задание 1

a = (input('Как Вас зовут? ') )
b = (input('Укажите название ВУЗ, в котором вы обучаетесь? ') )
c = (input('Укажите номер вашей группы. ') )
y = (input('Какой язык программирования вы начинаете изучать? ') )

print('-----------------')
print('Добрый день,', a+'!')
print('Вы обучаетесь в образовательной организации ', b)
print('В группе ', c)
print(a + ', желаем Вам успешного обучения программированию на языке', y)








